public class y02Expression {
    public static void main(String[] args) {
        /*
        Да се напише конзолна C# програма, която пресмята
         и отпечатва стойността на следния числен израз:

       (3522 + 52353) * 23 - (2336 * 501 + 23432 - 6743) * 3
       = -2275950

      Забележка: не е разрешено да се пресметне стойността
      предварително (например с Windows Calculator).
         */
        System.out.println(((3522 + 52353) * 23 - (2336 * 501 + 23432 - 6743) * 3));
    }
}
